{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data/0", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "embed_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t0_embed", 
      "inputs": [[0, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_i2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_i2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l0_i2h", 
      "inputs": [[2, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_h2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_h2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l0_h2h", 
      "inputs": [[6, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[5, 0], [9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t0_l0_slice", 
      "inputs": [[10, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation3", 
      "inputs": [[11, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation2", 
      "inputs": [[11, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l0_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul0", 
      "inputs": [[13, 0], [14, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation0", 
      "inputs": [[11, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation1", 
      "inputs": [[11, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul1", 
      "inputs": [[16, 0], [17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus1", 
      "inputs": [[15, 0], [18, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation4", 
      "inputs": [[19, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul2", 
      "inputs": [[12, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout0", 
      "inputs": [[21, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_i2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_i2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l1_i2h", 
      "inputs": [[22, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_h2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_h2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l1_h2h", 
      "inputs": [[26, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus2", 
      "inputs": [[25, 0], [29, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t0_l1_slice", 
      "inputs": [[30, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation8", 
      "inputs": [[31, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation7", 
      "inputs": [[31, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l1_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul3", 
      "inputs": [[33, 0], [34, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation5", 
      "inputs": [[31, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation6", 
      "inputs": [[31, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul4", 
      "inputs": [[36, 0], [37, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus3", 
      "inputs": [[35, 0], [38, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation9", 
      "inputs": [[39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul5", 
      "inputs": [[32, 0], [40, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout1", 
      "inputs": [[41, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_i2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_i2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l2_i2h", 
      "inputs": [[42, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_init_h", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_h2h_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_h2h_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t0_l2_h2h", 
      "inputs": [[46, 0], [47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus4", 
      "inputs": [[45, 0], [49, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t0_l2_slice", 
      "inputs": [[50, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation13", 
      "inputs": [[51, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation12", 
      "inputs": [[51, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "l2_init_c", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul6", 
      "inputs": [[53, 0], [54, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation10", 
      "inputs": [[51, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation11", 
      "inputs": [[51, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul7", 
      "inputs": [[56, 0], [57, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus5", 
      "inputs": [[55, 0], [58, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation14", 
      "inputs": [[59, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul8", 
      "inputs": [[52, 0], [60, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout2", 
      "inputs": [[61, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "cls_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "cls_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "84"
      }, 
      "name": "fullyconnected0", 
      "inputs": [[62, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label/0", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "t0_sm", 
      "inputs": [[65, 0], [66, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "data/1", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t1_embed", 
      "inputs": [[68, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l0_i2h", 
      "inputs": [[69, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l0_h2h", 
      "inputs": [[21, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6", 
      "inputs": [[70, 0], [71, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t1_l0_slice", 
      "inputs": [[72, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation18", 
      "inputs": [[73, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation17", 
      "inputs": [[73, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul9", 
      "inputs": [[75, 0], [19, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation15", 
      "inputs": [[73, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation16", 
      "inputs": [[73, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul10", 
      "inputs": [[77, 0], [78, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus7", 
      "inputs": [[76, 0], [79, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation19", 
      "inputs": [[80, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul11", 
      "inputs": [[74, 0], [81, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout3", 
      "inputs": [[82, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l1_i2h", 
      "inputs": [[83, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l1_h2h", 
      "inputs": [[41, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus8", 
      "inputs": [[84, 0], [85, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t1_l1_slice", 
      "inputs": [[86, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation23", 
      "inputs": [[87, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation22", 
      "inputs": [[87, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul12", 
      "inputs": [[89, 0], [39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation20", 
      "inputs": [[87, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation21", 
      "inputs": [[87, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul13", 
      "inputs": [[91, 0], [92, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus9", 
      "inputs": [[90, 0], [93, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation24", 
      "inputs": [[94, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul14", 
      "inputs": [[88, 0], [95, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout4", 
      "inputs": [[96, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l2_i2h", 
      "inputs": [[97, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t1_l2_h2h", 
      "inputs": [[61, 0], [47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus10", 
      "inputs": [[98, 0], [99, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t1_l2_slice", 
      "inputs": [[100, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation28", 
      "inputs": [[101, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation27", 
      "inputs": [[101, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul15", 
      "inputs": [[103, 0], [59, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation25", 
      "inputs": [[101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation26", 
      "inputs": [[101, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul16", 
      "inputs": [[105, 0], [106, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus11", 
      "inputs": [[104, 0], [107, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation29", 
      "inputs": [[108, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul17", 
      "inputs": [[102, 0], [109, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout5", 
      "inputs": [[110, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "84"
      }, 
      "name": "fullyconnected1", 
      "inputs": [[111, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label/1", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "t1_sm", 
      "inputs": [[112, 0], [113, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "data/2", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t2_embed", 
      "inputs": [[115, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l0_i2h", 
      "inputs": [[116, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l0_h2h", 
      "inputs": [[82, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus12", 
      "inputs": [[117, 0], [118, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t2_l0_slice", 
      "inputs": [[119, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation33", 
      "inputs": [[120, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation32", 
      "inputs": [[120, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul18", 
      "inputs": [[122, 0], [80, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation30", 
      "inputs": [[120, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation31", 
      "inputs": [[120, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul19", 
      "inputs": [[124, 0], [125, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus13", 
      "inputs": [[123, 0], [126, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation34", 
      "inputs": [[127, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul20", 
      "inputs": [[121, 0], [128, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout6", 
      "inputs": [[129, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l1_i2h", 
      "inputs": [[130, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l1_h2h", 
      "inputs": [[96, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus14", 
      "inputs": [[131, 0], [132, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t2_l1_slice", 
      "inputs": [[133, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation38", 
      "inputs": [[134, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation37", 
      "inputs": [[134, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul21", 
      "inputs": [[136, 0], [94, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation35", 
      "inputs": [[134, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation36", 
      "inputs": [[134, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul22", 
      "inputs": [[138, 0], [139, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus15", 
      "inputs": [[137, 0], [140, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation39", 
      "inputs": [[141, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul23", 
      "inputs": [[135, 0], [142, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout7", 
      "inputs": [[143, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l2_i2h", 
      "inputs": [[144, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t2_l2_h2h", 
      "inputs": [[110, 0], [47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus16", 
      "inputs": [[145, 0], [146, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t2_l2_slice", 
      "inputs": [[147, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation43", 
      "inputs": [[148, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation42", 
      "inputs": [[148, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul24", 
      "inputs": [[150, 0], [108, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation40", 
      "inputs": [[148, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation41", 
      "inputs": [[148, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul25", 
      "inputs": [[152, 0], [153, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus17", 
      "inputs": [[151, 0], [154, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation44", 
      "inputs": [[155, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul26", 
      "inputs": [[149, 0], [156, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout8", 
      "inputs": [[157, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "84"
      }, 
      "name": "fullyconnected2", 
      "inputs": [[158, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label/2", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "t2_sm", 
      "inputs": [[159, 0], [160, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "data/3", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t3_embed", 
      "inputs": [[162, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l0_i2h", 
      "inputs": [[163, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l0_h2h", 
      "inputs": [[129, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus18", 
      "inputs": [[164, 0], [165, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t3_l0_slice", 
      "inputs": [[166, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation48", 
      "inputs": [[167, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation47", 
      "inputs": [[167, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul27", 
      "inputs": [[169, 0], [127, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation45", 
      "inputs": [[167, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation46", 
      "inputs": [[167, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul28", 
      "inputs": [[171, 0], [172, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus19", 
      "inputs": [[170, 0], [173, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation49", 
      "inputs": [[174, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul29", 
      "inputs": [[168, 0], [175, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout9", 
      "inputs": [[176, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l1_i2h", 
      "inputs": [[177, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l1_h2h", 
      "inputs": [[143, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus20", 
      "inputs": [[178, 0], [179, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t3_l1_slice", 
      "inputs": [[180, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation53", 
      "inputs": [[181, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation52", 
      "inputs": [[181, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul30", 
      "inputs": [[183, 0], [141, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation50", 
      "inputs": [[181, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation51", 
      "inputs": [[181, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul31", 
      "inputs": [[185, 0], [186, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus21", 
      "inputs": [[184, 0], [187, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation54", 
      "inputs": [[188, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul32", 
      "inputs": [[182, 0], [189, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout10", 
      "inputs": [[190, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l2_i2h", 
      "inputs": [[191, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t3_l2_h2h", 
      "inputs": [[157, 0], [47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus22", 
      "inputs": [[192, 0], [193, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t3_l2_slice", 
      "inputs": [[194, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation58", 
      "inputs": [[195, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation57", 
      "inputs": [[195, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul33", 
      "inputs": [[197, 0], [155, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation55", 
      "inputs": [[195, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation56", 
      "inputs": [[195, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul34", 
      "inputs": [[199, 0], [200, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus23", 
      "inputs": [[198, 0], [201, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation59", 
      "inputs": [[202, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul35", 
      "inputs": [[196, 0], [203, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout11", 
      "inputs": [[204, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "84"
      }, 
      "name": "fullyconnected3", 
      "inputs": [[205, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label/3", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "t3_sm", 
      "inputs": [[206, 0], [207, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "data/4", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t4_embed", 
      "inputs": [[209, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l0_i2h", 
      "inputs": [[210, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l0_h2h", 
      "inputs": [[176, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus24", 
      "inputs": [[211, 0], [212, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t4_l0_slice", 
      "inputs": [[213, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation63", 
      "inputs": [[214, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation62", 
      "inputs": [[214, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul36", 
      "inputs": [[216, 0], [174, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation60", 
      "inputs": [[214, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation61", 
      "inputs": [[214, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul37", 
      "inputs": [[218, 0], [219, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus25", 
      "inputs": [[217, 0], [220, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation64", 
      "inputs": [[221, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul38", 
      "inputs": [[215, 0], [222, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout12", 
      "inputs": [[223, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l1_i2h", 
      "inputs": [[224, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l1_h2h", 
      "inputs": [[190, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus26", 
      "inputs": [[225, 0], [226, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t4_l1_slice", 
      "inputs": [[227, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation68", 
      "inputs": [[228, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation67", 
      "inputs": [[228, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul39", 
      "inputs": [[230, 0], [188, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation65", 
      "inputs": [[228, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation66", 
      "inputs": [[228, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul40", 
      "inputs": [[232, 0], [233, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus27", 
      "inputs": [[231, 0], [234, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation69", 
      "inputs": [[235, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul41", 
      "inputs": [[229, 0], [236, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout13", 
      "inputs": [[237, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l2_i2h", 
      "inputs": [[238, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t4_l2_h2h", 
      "inputs": [[204, 0], [47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus28", 
      "inputs": [[239, 0], [240, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t4_l2_slice", 
      "inputs": [[241, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation73", 
      "inputs": [[242, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation72", 
      "inputs": [[242, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul42", 
      "inputs": [[244, 0], [202, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation70", 
      "inputs": [[242, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation71", 
      "inputs": [[242, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul43", 
      "inputs": [[246, 0], [247, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus29", 
      "inputs": [[245, 0], [248, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation74", 
      "inputs": [[249, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul44", 
      "inputs": [[243, 0], [250, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout14", 
      "inputs": [[251, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "84"
      }, 
      "name": "fullyconnected4", 
      "inputs": [[252, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label/4", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "t4_sm", 
      "inputs": [[253, 0], [254, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "data/5", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Embedding", 
      "param": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "name": "t5_embed", 
      "inputs": [[256, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t5_l0_i2h", 
      "inputs": [[257, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t5_l0_h2h", 
      "inputs": [[223, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus30", 
      "inputs": [[258, 0], [259, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t5_l0_slice", 
      "inputs": [[260, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation78", 
      "inputs": [[261, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation77", 
      "inputs": [[261, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul45", 
      "inputs": [[263, 0], [221, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation75", 
      "inputs": [[261, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation76", 
      "inputs": [[261, 1]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul46", 
      "inputs": [[265, 0], [266, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus31", 
      "inputs": [[264, 0], [267, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation79", 
      "inputs": [[268, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul47", 
      "inputs": [[262, 0], [269, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.2"}, 
      "name": "dropout15", 
      "inputs": [[270, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t5_l1_i2h", 
      "inputs": [[271, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2048"
      }, 
      "name": "t5_l1_h2h", 
      "inputs": [[237, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus32", 
      "inputs": [[272, 0], [273, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "SliceChannel", 
      "param": {
        "axis": "1", 
        "num_outputs": "4", 
        "squeeze_axis": "False"
      }, 
      "name": "t5_l1_slice", 
      "inputs": [[274, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation83", 
      "inputs": [[275, 3]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation82", 
      "inputs": [[275, 2]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul48", 
      "inputs": [[277, 0], [235, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "sigmoid"}, 
      "name": "activation80", 
      "inputs": [[275, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation81", 
